rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
static ble_uuid_t m_sr_uuids[] =                                               /**< Universally unique service identifiers. */
{
    {SENSOR_SERVICE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}
};

//TWI Parameters
#if TWI0_ENABLED
#define TWI_INSTANCE_ID     0
#elif TWI1_ENABLED
#define TWI_INSTANCE_ID     1
#endif

const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);
volatile bool m_xfer_done = false; //Indicates if operation on TWI has ended.

//IMU Sensor Parameters
static stmdev_ctx_t lsm9ds1_imu;                                                /**< LSM9DS1 accelerometer/gyroscope instance. */
static stmdev_ctx_t lsm9ds1_mag;                                                /**< LSM9DS1 magnetometer instance. */

APP_TIMER_DEF(m_data_reading_timer);                                            /**< A timer used for collecting data from the LSM9DS1 (interrupts are disabled so a timer is needed). */
APP_TIMER_DEF(m_led_timer);                                                     /**< A timer used for LED timing */
#define NEXT_MEASUREMENT_DELAY          APP_TIMER_TICKS(1500)                   /**< Defines the delay between Sensor Measurments (1500 milliseconds). */
#define LED_DELAY                       APP_TIMER_TICKS(2000)                   /**< Defines the delay between LED blinks */
const nrf_drv_timer_t LED_ON_TIMER =    NRF_DRV_TIMER_INSTANCE(1);              /**< Timer to keep track of how long LEDs are turned on during a blink */

static uint8_t acc_characteristic_data[SENSOR_SAMPLES * SAMPLE_SIZE];
static uint8_t gyr_characteristic_data[SENSOR_SAMPLES * SAMPLE_SIZE];
static uint8_t mag_characteristic_data[SENSOR_SAMPLES * SAMPLE_SIZE];
uint8_t sensor_settings[SENSOR_SETTINGS_LENGTH];                               /**< An array represnting the IMU sensor settings */
static lsm9ds1_id_t whoamI;
static int measurements_taken = 0;

static int32_t write_imu(void *handle, uint8_t reg, const uint8_t *bufp, uint16_t len);
static int32_t read_imu(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len);
static int32_t write_mag(void *handle, uint8_t reg, const uint8_t *bufp, uint16_t len);
static int32_t read_mag(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len);
static void tx_com( uint8_t *tx_buffer, uint16_t len );
static int32_t get_IMU_data(uint8_t offset);
static int32_t get_MAG_data(uint8_t offset);

static personal_caddie_operating_mode_t current_operating_mode = ADVERTISING_MODE; /**< The chip starts in advertising mode*/

//Pin Setup
#define SENSOR_POWER_PIN        NRF_GPIO_PIN_MAP(1, 11)                         /**< Pin used to power external sensors (mapped to D2 on BLE 33)*/
#define SCL_PIN                 NRF_GPIO_PIN_MAP(1, 14)                         /**< Pin used for external TWI clock (mapped to D6 on BLE 33) */
#define SDA_PIN                 NRF_GPIO_PIN_MAP(1, 15)                         /**< Pin used for external TWI data (mapped to D4 on BLE 33) */
#define BLE_33_SENSOR_POWER_PIN NRF_GPIO_PIN_MAP(0, 22)                         /**< Pin used to power external sensors (mapped to D2 on BLE 33)*/
#define BLE_33_SCL_PIN          NRF_GPIO_PIN_MAP(0, 15)                         /**< Pin used for internal TWI clock for BLE33*/
#define BLE_33_SDA_PIN          NRF_GPIO_PIN_MAP(0, 14)                         /**< Pin used for internal TWI data for BLE33*/
#define BLE_33_PULLUP           NRF_GPIO_PIN_MAP(1, 0)                          /**< Pullup resistors on BLE 33 sense have separate power source*/
#define BLE_33_GREEN_LED        NRF_GPIO_PIN_MAP(1, 9)                          /**< Green LED Indicator on BLE 33 sense*/
#define BLE_33_RED_LED          NRF_GPIO_PIN_MAP(0, 24)                         /**< Red LED Indicator on BLE 33 sense*/
#define BLE_33_BLUE_LED         NRF_GPIO_PIN_MAP(0, 6)                          /**< Blue LED Indicator on BLE 33 sense*/
#define BLE_33_DARK_GREEN_LED   NRF_GPIO_PIN_MAP(0, 16)                         /**< Dark LED Indicator on BLE 33 sense*/
static volatile uint8_t active_led = BLE_33_BLUE_LED;                           /**< Variable used to keep track of which LED to turn on/off*/

static void advertising_start(bool erase_bonds);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Peer Manager events                   
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}

/**@brief Function for the LSM9DS1 initialization.
 *
 * @details Initializes the LSM9DS1 accelerometer, gyroscope and magnetometer
 */
static void sensors_init(void)
{
    //first reset the sensor settings array
    for (int i = 0; i < SENSOR_SETTINGS_LENGTH; i++) sensor_settings[i] = 0;

    //configure the power pin and pullup resistor pins for the the sensors
    nrf_gpio_cfg_output(BLE_33_PULLUP); //send power to BLE 33 Sense pullup resistors (they aren't connected to VDD)
    nrf_gpio_cfg(BLE_33_SENSOR_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_S0H1, NRF_GPIO_PIN_NOSENSE);
    
    //Handle the initialization of individual sensors
    lsm9ds1_init(&lsm9ds1_imu, &lsm9ds1_mag, sensor_settings, &m_twi, &m_xfer_done);

    //after sensor initialization is complete we attempt to communicate 
    //with each sensor just to ensure that it's there and working properly.
    //To do so, turn on the TWI bus and turn on the power pin(s) and pullup resistors
    nrf_drv_twi_enable(&m_twi);
    nrf_gpio_pin_set(BLE_33_PULLUP);
    nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);
    nrf_delay_ms(50); //slight delay so sensors have time to power on

    //attempt to read the WHOAMI register for each sensor
    uint32_t ret = lsm9ds1_dev_id_get(&lsm9ds1_mag, &lsm9ds1_imu, &whoamI);
    if (whoamI.imu == LSM9DS1_IMU_ID) SEGGER_RTT_WriteString(0, "LSM9DS1 discovered.\n");
    else SEGGER_RTT_WriteString(0, "Error: Couldn't find LSM9DS1.\n");

