rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    //In the future, more sensors can be initialized here

    //regardless of whether or not any sensors are found, disable the power pins and TWI bus
    nrf_gpio_pin_clear(BLE_33_PULLUP);
    nrf_gpio_pin_clear(BLE_33_SENSOR_POWER_PIN);
    nrf_drv_twi_disable(&m_twi);

    //After all sensors have been initialized, update the sensor settings characteristic to 
    //reflect the sensor settings array. Furthermore, we also set the connection interval 
    //to be equal to the highest sensor ODR (to the nearest 15th millisecond)
    ble_gatts_value_t settings;
    settings.len = SENSOR_SETTINGS_LENGTH;
    settings.p_value = sensor_settings;
    uint32_t err_code = sd_ble_gatts_value_set(m_conn_handle, m_ss.settings_handles.value_handle, &settings);
    APP_ERROR_CHECK(err_code);
}

static void characteristic_update_and_notify()
{
    
    ble_gatts_hvx_params_t acc_notify_params, gyr_notify_params, mag_notify_params;
    memset(&acc_notify_params, 0, sizeof(acc_notify_params));
    memset(&gyr_notify_params, 0, sizeof(gyr_notify_params));
    memset(&mag_notify_params, 0, sizeof(mag_notify_params));

    uint16_t data_characteristic_size = SENSOR_SAMPLES * SAMPLE_SIZE; //not really sure why the size needs to be passed in as a reference

    //Setup accelerometer notification first
    acc_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    acc_notify_params.handle = m_ss.data_handles[0].value_handle;
    acc_notify_params.p_data = acc_characteristic_data;
    acc_notify_params.p_len  = &data_characteristic_size;
    acc_notify_params.offset = 0;

    //Setup gyroscope notification second
    gyr_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    gyr_notify_params.handle = m_ss.data_handles[1].value_handle;
    gyr_notify_params.p_data = gyr_characteristic_data;
    gyr_notify_params.p_len  = &data_characteristic_size;
    gyr_notify_params.offset = 0;

    //Setup magnetometer notification third
    mag_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    mag_notify_params.handle = m_ss.data_handles[2].value_handle;
    mag_notify_params.p_data = mag_characteristic_data;
    mag_notify_params.p_len  = &data_characteristic_size;
    mag_notify_params.offset = 0;

    sd_ble_gatts_hvx(m_conn_handle, &acc_notify_params);
    sd_ble_gatts_hvx(m_conn_handle, &gyr_notify_params);
    sd_ble_gatts_hvx(m_conn_handle, &mag_notify_params);
}

static void data_reading_timer_handler(void * p_context)
{
    //uint32_t time_stamp = nrf_drv_timer_capture(&my_timer, NRF_TIMER_CC_CHANNEL1);
    //float clock_conversion = 1.0 / 16000000.0;
    //float actual_time = time_stamp * clock_conversion;
    //SEGGER_RTT_printf(0, "TWI initiated at %u ticks of 16MHz.\n", time_stamp);

    //Everytime the data reading timer goes off we take sensor readings and then 
    //update the appropriate characteristic values.
    int measurements_taken = 0;
    while (measurements_taken < SENSOR_SAMPLES)
    {
        get_IMU_data(SAMPLE_SIZE * measurements_taken);
        get_MAG_data(SAMPLE_SIZE * measurements_taken);
        measurements_taken++;
    }

    //after the samples are read, update the characteristics and notify
    characteristic_update_and_notify();
}

static void led_timer_handler(void * p_context)
{
    //This timer causes the currently active LED to light up. A separate timer is used to 
    //turn the LED back off after a set time period
    nrf_gpio_pin_clear(active_led);
    nrf_drv_timer_clear(&LED_ON_TIMER); //reset the LED-on timer
    nrf_drv_timer_enable(&LED_ON_TIMER); //turn on the LED_on timer, the handler for this timer will turn the LED back off
    //uint32_t timer_val = nrf_drv_timer_capture(&LED_ON_TIMER, NRF_TIMER_CC_CHANNEL1);
}

void led_on_timer_handler(nrf_timer_event_t event_type, void* p_context)
{
    //This handler gets called when an LED is turned to the active state. Simply turn the 
    //LED back off when this handler is called and then turn the LED-on timer off.
    nrf_gpio_pin_set(active_led);
    nrf_drv_timer_disable(&LED_ON_TIMER);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create a non-ble timer to help keep track of LED on time
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.frequency = NRF_TIMER_FREQ_16MHz;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;

    err_code = nrf_drv_timer_init(&LED_ON_TIMER, &timer_cfg, led_on_timer_handler);
    APP_ERROR_CHECK(err_code);

    //TODO: Lower the led on timer when done testing
    uint32_t led_on_time = nrf_drv_timer_ms_to_ticks(&LED_ON_TIMER, 25); //the LEDs will only be on for 2 milliseconds while blinking
    nrf_drv_timer_extended_compare(&LED_ON_TIMER, NRF_TIMER_CC_CHANNEL0, led_on_time, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true); //calls the led_on_timer_handler

    // Create custom timers.
    app_timer_create(&m_data_reading_timer, APP_TIMER_MODE_REPEATED, data_reading_timer_handler);
    app_timer_create(&m_led_timer, APP_TIMER_MODE_REPEATED, led_timer_handler);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

    //calculate the connection interval based on the ODR of the sensor
    //TODO: It would be better to move this into the sensor_init() method
    //      but for some reason I waas getting an error when putting it there.
    float sensor_odr = lsm9ds1_odr_calculate(sensor_settings[ODR + GYR_START], sensor_settings[ODR + MAG_START]);

    int minimum_interval_required = 1000.0 / sensor_odr * SENSOR_SAMPLES + 1; //this is in milliseconds, hence the 1000
    minimum_interval_required += (15 - minimum_interval_required % 15); //round up to the nearest 15th millisecond

