rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    //Convert from milliseconds to 1.25 millisecond units by dividing by 1.25 (same multiplying by 4/5)
    int mir_125 = minimum_interval_required / 5;
    mir_125 *= 4;

    gap_conn_params.min_conn_interval = mir_125;
    gap_conn_params.max_conn_interval = mir_125 + 12; //must be 15 ms (or 12 in 1.25ms units) greater at a minimum
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = SENSOR_CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

//Functions for updating sensor power modes and settings
static void sensor_idle_mode_start()
{ 
    //In this mode, the TWI bus is active and power is going to the LSM9DS1 but the 
    //sensor is put into sleep mode. A red LED blinking in time with the connection 
    //interval shows when this mode is active.
    if (current_operating_mode == SENSOR_IDLE_MODE) return; //no need to change anything if already in idle mode

    active_led = BLE_33_RED_LED; //swap to the red LED
    ret_code_t err_code;

    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        //If we're transitioning from active to idle mode we need to stop the data collection timer
        //and then put the sensor into sleep mode.
        err_code = app_timer_stop(m_data_reading_timer); //Even if the timer isn't actively on it's ok to call this method
        lsm9ds1_idle_mode_enable(&lsm9ds1_imu, &lsm9ds1_mag);

        //the LED is deactivated during data collection so turn it back on
        err_code = app_timer_start(m_led_timer, LED_DELAY, NULL); //Even if the timer is already on it's ok to call this method
    }
    else 
    {
        //If we aren't in sensor active or idle mode, it means that we arrived here from connection mode.
        //This means that both the TWI bus and LSM9DS1 need to be turned on. No need to put the LSM9DS1 
        //into sleep mode as this happens automatically upon power up.

        // Leave the below two lines commented for future reference
        //uint32_t enabled = m_twi.u.twim.p_twim->ENABLE;
        //if (enabled == 0) nrf_drv_twi_enable(&m_twi);

        //turn on the TWI bus
        nrf_drv_twi_enable(&m_twi);

        //Power the sensor and the pullup resistors to the SCL and SDA line
        nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);
        nrf_gpio_pin_set(BLE_33_PULLUP);
    }

    current_operating_mode = SENSOR_IDLE_MODE; //set the current operating mode to idle
}

static void sensor_active_mode_start()
{
    if (current_operating_mode != SENSOR_IDLE_MODE) return; //we can only go to active mode from idle mode

    //All of the settings for the sensor should have been set already, we just need to activate them
    //and then start the data collection timer. We also disable the LED to save on power
    app_timer_stop(m_led_timer); //disable the led by turning of it's timer

    //turn on the sensors by applying the current settings in the settings array
    lsm9ds1_active_mode_enable(&lsm9ds1_imu, &lsm9ds1_mag);
    
    current_operating_mode = SENSOR_ACTIVE_MODE; //set the current operating mode to idle
}

static void connected_mode_start()
{
    //We'll other be put into this mode from advertising mode (in which case all we need to do is 
    //change the color of the blinking LED, or from sensor_idle mode, in which case we need to 
    //disable the power going to the sensor and the TWI bus.
    if (current_operating_mode == SENSOR_IDLE_MODE)
    {
        //The chip is currently in sensor idle mode so we need to power off the sensor and disable the TWI bus
        //Disable power to the sensor and the pullup resistors to the SCL and SDA line
        nrf_gpio_pin_clear(BLE_33_SENSOR_POWER_PIN);
        nrf_gpio_pin_clear(BLE_33_PULLUP);

        //Turn off the TWI bus
        nrf_drv_twi_disable(&m_twi);
    }

    //change the color of the blinking LED
    active_led = BLE_33_DARK_GREEN_LED; //swap to the red LED
    current_operating_mode = CONNECTED_MODE; //set the current operating mode to idle
}

static void advertising_mode_start()
{
    //There are two ways to get into advertising mode, either by turning the device on,
    //or by losing a connection to a central device (whether this is intentional or 
    //accidental). In the latter case, we need to disable any sensors or peripherals
    //to save on power.

    switch (current_operating_mode)
    {
        case ADVERTISING_MODE:
            return; //no changes need to be made so leave the method
        case SENSOR_ACTIVE_MODE:
            sensor_idle_mode_start();
            //break statement purposely omitted here
        case SENSOR_IDLE_MODE:
            connected_mode_start();
            //break statement purposely omitted here
        default:
            active_led = BLE_33_BLUE_LED;
            break;
    }

    current_operating_mode = ADVERTISING_MODE; //set the current operating mode to idle
    
    //finally, we need to terminate the existing connection
    //TODO: Implement this feature
}

/**@brief Function for handling write events to the Sensor Settings Characteristic.
 *
 * @param[in] p_lbs     Instance of Sensor Settings Service to which the write applies.
 * @param[in] led_state Written/desired state for the sensor settings.
 */
static void sensor_settings_write_handler(uint16_t conn_handle, ble_sensor_service_t * p_ss, const uint8_t* settings_state)
{
    //Different things can happen depending on what gets written to the settings characteristic
    switch (*settings_state)
    {
        case 0:
            advertising_mode_start();
            break;
        case 1:
            connected_mode_start();
            break;
        case 2:
            sensor_idle_mode_start();
            break;
        case 3:
            sensor_idle_mode_start();
            for (int i = 1; i < SENSOR_SETTINGS_LENGTH; i++) sensor_settings[i] = *(settings_state + i);
            break;
        case 4:
            sensor_idle_mode_start();
            sensor_settings[*(settings_state + 1)] = *(settings_state + 2);
            break;
        case 5:
            sensor_active_mode_start();
            break;
    }

